StockList = """
元大台灣50 0050
元大高股息 0056
富邦上証 006205
元大上證50 006206
國泰中國A50 00636
富邦深100 00639
群益深証中小 00643
元大美債20年 00679B
國泰20年美債 00687B
元大美債1-3 00719B
統一FANG+ 00757
中信高評級公司債 00772B
國泰永續高股息 00878
富邦越南 00885
國泰智能電動車 00893
群益台灣精選高息 00919
群益台ESG低碳50 00923
復華台灣科技優息 00929
群益ESG投等債20+ 00937B
元大台灣價值高息 00940
台泥 1101
亞泥 1102
大成 1210
統一 1216
台塑 1301
南亞 1303
國喬 1312
中石化 1314
東陽 1319
台化 1326
遠東新 1402
南紡 1440
儒鴻 1476
聚陽 1477
士電 1503
東元 1504
中興電 1513
和大 1536
精華 1565
亞德客-KY 1590
華新 1605
大亞 1609
葡萄王 1707
長興 1717
中纖 1718
台肥 1722
美時 1795
台玻 1802
正隆 1904
華紙 1905
永豐餘 1907
榮成 1909
中鋼 2002
東和鋼鐵 2006
中鴻 2014
大成鋼 2027
上銀 2049
川湖 2059
正新 2105
裕隆 2201
為升 2231
光寶科 2301
聯電 2303
台達電 2308
金寶 2312
華通 2313
鴻海 2317
中環 2323
仁寶 2324
國巨 2327
廣宇 2328
台積電 2330
精英 2331
友訊 2332
旺宏 2337
光罩 2338
台亞 2340
華邦電 2344
智邦 2345
聯強 2347
佳世達 2352
宏碁 2353
鴻準 2354
敬鵬 2355
英業達 2356
華碩 2357
致茂 2360
金像電 2368
大同 2371
技嘉 2376
微星 2377
瑞昱 2379
廣達 2382
台光電 2383
群光 2385
威盛 2388
正崴 2392
億光 2393
凌陽 2401
漢唐 2404
南亞科 2408
友達 2409
中華電 2412
美律 2439
超豐 2441
京元電子 2449
聯發科 2454
全新 2455
飛宏 2457
義隆 2458
可成 2474
強茂 2481
兆赫 2485
一詮 2486
瑞軒 2489
華新科 2492
宏達電 2498
中工 2515
冠德 2520
興富發 2542
華固 2548
長榮 2603
新興 2605
裕民 2606
陽明 2609
華航 2610
萬海 2615
長榮航 2618
台灣高鐵 2633
漢翔 2634
彰銀 2801
臺企銀 2834
華南金 2880
富邦金 2881
國泰金 2882
凱基金 2883
玉山金 2884
元大金 2885
兆豐金 2886
台新金 2887
新光金 2888
永豐金 2890
中信金 2891
第一金 2892
農林 2913
潤泰全 2915
神基 3005
晶豪科 3006
大立光 3008
奇鋐 3017
亞光 3019
聯詠 3034
智原 3035
文曄 3036
欣興 3037
晶技 3042
健鼎 3044
台灣大 3045
僑威 3078
聯亞 3081
穩懋 3105
璟德 3152
景碩 3189
原相 3227
緯創 3231
威剛 3260
欣銓 3264
鈊象 3293
雙鴻 3324
精材 3374
新日興 3376
明泰 3380
玉晶光 3406
創意 3443
群創 3481
力旺 3529
台勝科 3532
嘉澤 3533
同致 3552
健策 3653
世芯-KY 3661
TPK-KY 3673
家登 3680
碩禾 3691
大聯大 3702
神達 3706
日月光投控 3711
富采 3714
晟德 4123
中天 4128
智擎 4162
泰博 4736
合一 4743
遠傳 4904
新唐 4919
和碩 4938
臻鼎-KY 4958
榮剛 5009
祥碩 5269
信驊 5274
世界 5347
中光電 5371
中磊 5388
台半 5425
宣德 5457
中美晶 5483
長虹 5534
中租-KY 5871
上海商銀 5876
合庫金 5880
寶雅 5904
群益證 6005
彩晶 6116
新普 6121
亞翔 6139
頎邦 6147
嘉聯益 6153
信昌電 6173
瑞儀 6176
合晶 6182
廣明 6188
聯茂 6213
旺矽 6223
力成 6239
立端 6245
矽格 6257
台郡 6269
同欣電 6271
台燿 6274
台表科 6278
胡連 6279
康舒 6282
啟碁 6285
樺漢 6414
元晶 6443
保瑞 6472
環球晶 6488
台塑化 6505
精測 6510
達發 6526
高端疫苗 6547
緯穎 6669
台灣虎航 6757
力積電 6770
台虹 8039
網家 8044
南電 8046
元太 8069
宏捷科 8086
至上 8112
南茂 8150
達方 8163
群聯 8299
金居 8358
大江 8436
富邦媒 8454
寶成 9904
美利達 9914
百和 9938
宏全 9939
潤泰新 9945
世紀鋼 9958
加權指數 TSE
電子 TSE23
金融保險 TSE28
台灣中型100指數 TWMC
"""

FutureList = """
CAF00 南亞期近月
CBF00 中鋼期近月
CCF00 聯電期近月(一般)
CDF00 台積電期近月(一般)
CEF00 富邦金期近月
CFF00 台塑期近月
CGF00 仁寶期近月
CHF00 友達期近月
CJF00 華南金期近月
CKF00 國泰金期近月
CLF00 兆豐金期近月
CMF00 台新金期近月
CNF00 中信金期近月
CQF00 統一期近月
CRF00 遠東新期近月
CSF00 華新期近月
CUF00 中環期近月
CWF00 佳世達期近月
CXF00 大同期近月
CYF00 南亞科期近月
CZF00 長榮期近月
DAF00 陽明期近月
DBF00 華航期近月
DCF00 彰銀期近月
DEF00 永豐金期近月
DFF00 台泥期近月
DGF00 台化期近月
DHF00 鴻海期近月
DIF00 旺宏期近月
DJF00 華碩期近月
DKF00 廣達期近月
DLF00 中華電期近月
DNF00 玉山金期近月
DOF00 元大金期近月
DPF00 第一金期近月
DQF00 群創期近月
DSF00 宏碁期近月
DVF00 聯發科期近月
DWF00 潤泰全期近月
DXF00 緯創期近月
DYF00 亞泥期近月
DZF00 大成期近月
EEF00 國喬期近月
EGF00 中石化期近月
EHF00 東陽期近月
EKF00 南紡期近月
EMF00 東元期近月
EPF00 亞德客-KY期近月
EYF00 中纖期近月
EZF00 台肥期近月
FBF00 東和鋼鐵期近月
FCF00 中鴻期近月
FEF00 大成鋼期近月
FFF00 上銀期近月
FGF00 川湖期近月
FKF00 正新期近月
FNF00 裕隆期近月
FQF00 光寶科期近月
FRF00 台達電期近月
FSF00 金寶期近月
FTF00 華通期近月
FVF00 精英期近月
FWF00 友訊期近月
FYF00 台亞期近月
FZF00 華邦電期近月
GAF00 聯強期近月
GCF00 鴻準期近月
GHF00 技嘉期近月
GIF00 微星期近月
GJF00 瑞昱期近月
GKF00 群光期近月
GLF00 正崴期近月
GMF00 億光期近月
GNF00 凌陽期近月
GOF00 漢唐期近月
GRF00 京元電子期近月
GUF00 全新期近月
GVF00 飛宏期近月
GWF00 義隆期近月
GXF00 可成期近月
GYF00 強茂期近月
GZF00 兆赫期近月
HAF00 瑞軒期近月
HBF00 華新科期近月
HCF00 宏達電期近月
HHF00 中工期近月
HIF00 冠德期近月
HLF00 興富發期近月
HOF00 華固期近月
HQF00 新興期近月
HSF00 長榮航期近月
IAF00 臺企銀期近月
IHF00 農林期近月
IIF00 晶豪科期近月
IJF00 大立光期近月
IMF00 亞光期近月
IOF00 聯詠期近月
IPF00 智原期近月
IQF00 文曄期近月
IRF00 欣興期近月
ITF00 晶技期近月
IXF00 景碩期近月
IYF00 新日興期近月
IZF00 明泰期近月
JBF00 創意期近月
JFF00 嘉澤期近月
JMF00 健策期近月
JNF00 TPK-KY期近月
JPF00 大聯大期近月
JSF00 和碩期近月
JWF00 長虹期近月
JXF00 群益證期近月
JZF00 嘉聯益期近月
KAF00 瑞儀期近月
KBF00 聯茂期近月
KCF00 力成期近月
KDF00 同欣電期近月
KEF00 台表科期近月
KFF00 康舒期近月
KGF00 啟碁期近月
KIF00 台虹期近月
KKF00 達方期近月
KLF00 寶成期近月
KOF00 宏全期近月
KPF00 潤泰新期近月
KSF00 聚陽期近月
KUF00 台玻期近月
KWF00 廣宇期近月
LBF00 健鼎期近月
LCF00 台灣大期近月
LEF00 玉晶光期近月
LIF00 台郡期近月
LMF00 美利達期近月
LOF00 合庫金期近月
LQF00 英業達期近月
LRF00 凱基金期近月
LTF00 遠傳期近月
LUF00 臻鼎-KY期近月
LVF00 中租-KY期近月
LWF00 儒鴻期近月
LXF00 國巨期近月
LYF00 南電期近月
MAF00 葡萄王期近月
MBF00 敬鵬期近月
MJF00 致茂期近月
MKF00 美律期近月
MQF00 矽格期近月
MVF00 百和期近月
MYF00 精華期近月
NAF00 穩懋期近月
NBF00 璟德期近月
NDF00 威剛期近月
NEF00 欣銓期近月
NGF00 碩禾期近月
NIF00 晟德期近月
NJF00 榮剛期近月
NLF00 世界期近月
NMF00 中光電期近月
NOF00 中美晶期近月
NQF00 新普期近月
NSF00 頎邦期近月
NUF00 網家期近月
NVF00 元太期近月
NWF00 群聯期近月
NYF00 元大台灣50ETF期近月(一般)
OAF00 富邦上証期近月
OBF00 元大上證50期近月
ODF00 為升期近月
OEF00 彩晶期近月
OHF00 胡連期近月
OJF00 國泰中國A50期近月
OKF00 富邦深100期近月
OLF00 小型大立光期近月
OMF00 小型精華期近月
OOF00 群益深証中小期近月
OPF00 智邦期近月
OQF00 樺漢期近月
ORF00 和大期近月
OSF00 榮成期近月
OTF00 聯亞期近月
OUF00 同致期近月
OVF00 台燿期近月
OWF00 環球晶期近月
OXF00 精測期近月
OYF00 小型精測期近月
OZF00 日月光投控期近月
PAF00 原相期近月
PBF00 小型環球晶期近月
PCF00 智擎期近月
PDF00 泰博期近月
PEF00 台半期近月
PFF00 元大高股息期近月
PGF00 台灣高鐵期近月
PHF00 祥碩期近月
PIF00 力旺期近月
PJF00 台光電期近月
PKF00 信昌電期近月
PLF00 合晶期近月
PMF00 大江期近月
PNF00 小型祥碩期近月
PPF00 宣德期近月
PQF00 金居期近月
PRF00 宏捷科期近月
PSF00 神達期近月
PTF00 雙鴻期近月
PUF00 小型聯發科期近月
PVF00 緯穎期近月
PWF00 小型緯穎期近月
PXF00 鈊象期近月
PYF00 小型鈊象期近月
PZF00 信驊期近月
QAF00 小型信驊期近月
QBF00 富采期近月
QCF00 裕民期近月
QDF00 台勝科期近月
QEF00 小型國巨期近月
QFF00 小型台積電期近月(一般)
QGF00 小型瑞昱期近月
QHF00 小型聯詠期近月
QIF00 小型穩懋期近月
QJF00 小型玉晶光期近月
QKF00 永豐餘期近月
QLF00 精材期近月
QMF00 小型上銀期近月
QNF00 小型群聯期近月
QOF00 長興期近月
QPF00 正隆期近月
QQF00 僑威期近月
QRF00 小型華碩期近月
QSF00 小型南電期近月
QTF00 超豐期近月
QUF00 南茂期近月
QVF00 光罩期近月
QWF00 威盛期近月
QXF00 萬海期近月
QYF00 高端疫苗期近月
QZF00 力積電期近月
RAF00 奇鋐期近月
RBF00 中磊期近月
RCF00 漢翔期近月
RDF00 中天期近月
REF00 新唐期近月
RFF00 小型嘉澤期近月
RGF00 小型健策期近月
RIF00 國泰永續高股息期近月
RJF00 大亞期近月
RKF00 金像電期近月
RLF00 元晶期近月
RMF00 富邦媒期近月
RNF00 合一期近月
ROF00 立端期近月
RPF00 寶雅期近月
RQF00 小型富邦媒期近月
RRF00 小型寶雅期近月
RSF00 小型力旺期近月
RUF00 世紀鋼期近月
RVF00 小型台達電期近月
RWF00 小型創意期近月
RXF00 富邦越南期近月
RYF00 群益台ESG低碳50期近月
RZF00 元大美債20年期近月(一般)
SAF00 美時期近月
SBF00 華紙期近月
SCF00 小型聚陽期近月
SDF00 中興電期近月
SEF00 小型智邦期近月
SFF00 小型台光電期近月
SGF00 國泰智能電動車期近月
SIF00 元大美債1-3期近月
SJF00 神基期近月
SKF00 至上期近月
SLF00 小型技嘉期近月
SMF00 群益台灣精選高息期近月
SNF00 復華台灣科技優息期近月
SQF00 中信高評級公司債期近月
SRF00 小型元大台灣50ETF期近月(一般)
SSF00 小型元大高股息期近月
SUF00 元大台灣價值高息期近月
SVF00 小型川湖期近月
SWF00 小型世紀鋼期近月
SYF00 家登期近月
SZF00 小型家登期近月
UAF00 士電期近月
UBF00 亞翔期近月
UCF00 廣明期近月
UEF00 上海商銀期近月
UFF00 台塑化期近月
UGF00 達發期近月
UHF00 小型奇鋐期近月
UIF00 小型達發期近月
UJF00 群益ESG投等債20+期近月
UKF00 國泰20年美債期近月
ULF00 小型雙鴻期近月
UMF00 世芯-KY期近月
UOF00 小型世芯-KY期近月
UPF00 保瑞期近月
UQF00 小型保瑞期近月
URF00 統一FANG+期近月
USF00 小型統一FANG+期近月
UTF00 一詮期近月
UUF00 台灣虎航期近月
UVF00 旺矽期近月
UWF00 小型旺矽期近月
"""

Compare_Map = """
南亞期近月 南亞期 南亞 1303
中鋼期近月 中鋼期 中鋼 2002
聯電期近月(一般) 聯電期 聯電 2303
台積電期近月(一般) 台積電期 台積電 2330
富邦金期近月 富邦金期 富邦金 2881
台塑期近月 台塑期 台塑 1301
仁寶期近月 仁寶期 仁寶 2324
友達期近月 友達期 友達 2409
華南金期近月 華南金期 華南金 2880
國泰金期近月 國泰金期 國泰金 2882
兆豐金期近月 兆豐金期 兆豐金 2886
台新金期近月 台新金期 台新金 2887
中信金期近月 中信金期 中信金 2891
統一期近月 統一期 統一 1216
遠東新期近月 遠東新期 遠東新 1402
華新期近月 華新期 華新 1605
中環期近月 中環期 中環 2323
佳世達期近月 佳世達期 佳世達 2352
大同期近月 大同期 大同 2371
南亞科期近月 南亞科期 南亞科 2408
長榮期近月 長榮期 長榮 2603
陽明期近月 陽明期 陽明 2609
華航期近月 華航期 華航 2610
彰銀期近月 彰銀期 彰銀 2801
永豐金期近月 永豐金期 永豐金 2890
台泥期近月 台泥期 台泥 1101
台化期近月 台化期 台化 1326
鴻海期近月 鴻海期 鴻海 2317
旺宏期近月 旺宏期 旺宏 2337
華碩期近月 華碩期 華碩 2357
廣達期近月 廣達期 廣達 2382
中華電期近月 中華電期 中華電 2412
玉山金期近月 玉山金期 玉山金 2884
元大金期近月 元大金期 元大金 2885
第一金期近月 第一金期 第一金 2892
群創期近月 群創期 群創 3481
宏碁期近月 宏碁期 宏碁 2353
聯發科期近月 聯發科期 聯發科 2454
潤泰全期近月 潤泰全期 潤泰全 2915
緯創期近月 緯創期 緯創 3231
亞泥期近月 亞泥期 亞泥 1102
大成期近月 大成期 大成 1210
國喬期近月 國喬期 國喬 1312
中石化期近月 中石化期 中石化 1314
東陽期近月 東陽期 東陽 1319
南紡期近月 南紡期 南紡 1440
東元期近月 東元期 東元 1504
亞德客-KY期近月 亞德客-KY期 亞德客-KY 1590
中纖期近月 中纖期 中纖 1718
台肥期近月 台肥期 台肥 1722
東和鋼鐵期近月 東和鋼鐵期 東和鋼鐵 2006
中鴻期近月 中鴻期 中鴻 2014
大成鋼期近月 大成鋼期 大成鋼 2027
上銀期近月 上銀期 上銀 2049
川湖期近月 川湖期 川湖 2059
正新期近月 正新期 正新 2105
裕隆期近月 裕隆期 裕隆 2201
光寶科期近月 光寶科期 光寶科 2301
台達電期近月 台達電期 台達電 2308
金寶期近月 金寶期 金寶 2312
華通期近月 華通期 華通 2313
精英期近月 精英期 精英 2331
友訊期近月 友訊期 友訊 2332
台亞期近月 台亞期 台亞 2340
華邦電期近月 華邦電期 華邦電 2344
聯強期近月 聯強期 聯強 2347
鴻準期近月 鴻準期 鴻準 2354
技嘉期近月 技嘉期 技嘉 2376
微星期近月 微星期 微星 2377
瑞昱期近月 瑞昱期 瑞昱 2379
群光期近月 群光期 群光 2385
正崴期近月 正崴期 正崴 2392
億光期近月 億光期 億光 2393
凌陽期近月 凌陽期 凌陽 2401
漢唐期近月 漢唐期 漢唐 2404
京元電子期近月 京元電子期 京元電子 2449
全新期近月 全新期 全新 2455
飛宏期近月 飛宏期 飛宏 2457
義隆期近月 義隆期 義隆 2458
可成期近月 可成期 可成 2474
強茂期近月 強茂期 強茂 2481
兆赫期近月 兆赫期 兆赫 2485
瑞軒期近月 瑞軒期 瑞軒 2489
華新科期近月 華新科期 華新科 2492
宏達電期近月 宏達電期 宏達電 2498
中工期近月 中工期 中工 2515
冠德期近月 冠德期 冠德 2520
興富發期近月 興富發期 興富發 2542
華固期近月 華固期 華固 2548
新興期近月 新興期 新興 2605
長榮航期近月 長榮航期 長榮航 2618
臺企銀期近月 臺企銀期 臺企銀 2834
農林期近月 農林期 農林 2913
晶豪科期近月 晶豪科期 晶豪科 3006
大立光期近月 大立光期 大立光 3008
亞光期近月 亞光期 亞光 3019
聯詠期近月 聯詠期 聯詠 3034
智原期近月 智原期 智原 3035
文曄期近月 文曄期 文曄 3036
欣興期近月 欣興期 欣興 3037
晶技期近月 晶技期 晶技 3042
景碩期近月 景碩期 景碩 3189
新日興期近月 新日興期 新日興 3376
明泰期近月 明泰期 明泰 3380
創意期近月 創意期 創意 3443
嘉澤期近月 嘉澤期 嘉澤 3533
健策期近月 健策期 健策 3653
TPK-KY期近月 TPK-KY期 TPK-KY 3673
大聯大期近月 大聯大期 大聯大 3702
和碩期近月 和碩期 和碩 4938
長虹期近月 長虹期 長虹 5534
群益證期近月 群益證期 群益證 6005
嘉聯益期近月 嘉聯益期 嘉聯益 6153
瑞儀期近月 瑞儀期 瑞儀 6176
聯茂期近月 聯茂期 聯茂 6213
力成期近月 力成期 力成 6239
同欣電期近月 同欣電期 同欣電 6271
台表科期近月 台表科期 台表科 6278
康舒期近月 康舒期 康舒 6282
啟碁期近月 啟碁期 啟碁 6285
台虹期近月 台虹期 台虹 8039
達方期近月 達方期 達方 8163
寶成期近月 寶成期 寶成 9904
宏全期近月 宏全期 宏全 9939
潤泰新期近月 潤泰新期 潤泰新 9945
聚陽期近月 聚陽期 聚陽 1477
台玻期近月 台玻期 台玻 1802
廣宇期近月 廣宇期 廣宇 2328
健鼎期近月 健鼎期 健鼎 3044
台灣大期近月 台灣大期 台灣大 3045
玉晶光期近月 玉晶光期 玉晶光 3406
台郡期近月 台郡期 台郡 6269
美利達期近月 美利達期 美利達 9914
合庫金期近月 合庫金期 合庫金 5880
英業達期近月 英業達期 英業達 2356
凱基金期近月 凱基金期 凱基金 2883
遠傳期近月 遠傳期 遠傳 4904
臻鼎-KY期近月 臻鼎-KY期 臻鼎-KY 4958
中租-KY期近月 中租-KY期 中租-KY 5871
儒鴻期近月 儒鴻期 儒鴻 1476
國巨期近月 國巨期 國巨 2327
南電期近月 南電期 南電 8046
葡萄王期近月 葡萄王期 葡萄王 1707
敬鵬期近月 敬鵬期 敬鵬 2355
致茂期近月 致茂期 致茂 2360
美律期近月 美律期 美律 2439
矽格期近月 矽格期 矽格 6257
百和期近月 百和期 百和 9938
精華期近月 精華期 精華 1565
穩懋期近月 穩懋期 穩懋 3105
璟德期近月 璟德期 璟德 3152
威剛期近月 威剛期 威剛 3260
欣銓期近月 欣銓期 欣銓 3264
碩禾期近月 碩禾期 碩禾 3691
晟德期近月 晟德期 晟德 4123
榮剛期近月 榮剛期 榮剛 5009
世界期近月 世界期 世界 5347
中光電期近月 中光電期 中光電 5371
中美晶期近月 中美晶期 中美晶 5483
新普期近月 新普期 新普 6121
頎邦期近月 頎邦期 頎邦 6147
網家期近月 網家期 網家 8044
元太期近月 元太期 元太 8069
群聯期近月 群聯期 群聯 8299
元大台灣50ETF期近月(一般) 元大台灣50ETF期 元大台灣50ETF 0050
富邦上証期近月 富邦上証期 富邦上証 006205
元大上證50期近月 元大上證50期 元大上證50 006206
為升期近月 為升期 為升 2231
彩晶期近月 彩晶期 彩晶 6116
胡連期近月 胡連期 胡連 6279
國泰中國A50期近月 國泰中國A50期 國泰中國A50 00636
富邦深100期近月 富邦深100期 富邦深100 00639
小型大立光期近月 小型大立光期 大立光 3008
小型精華期近月 小型精華期 精華 1565
群益深証中小期近月 群益深証中小期 群益深証中小 00643
智邦期近月 智邦期 智邦 2345
樺漢期近月 樺漢期 樺漢 6414
和大期近月 和大期 和大 1536
榮成期近月 榮成期 榮成 1909
聯亞期近月 聯亞期 聯亞 3081
同致期近月 同致期 同致 3552
台燿期近月 台燿期 台燿 6274
環球晶期近月 環球晶期 環球晶 6488
精測期近月 精測期 精測 6510
小型精測期近月 小型精測期 精測 6510
日月光投控期近月 日月光投控期 日月光投控 3711
原相期近月 原相期 原相 3227
小型環球晶期近月 小型環球晶期 環球晶 6488
智擎期近月 智擎期 智擎 4162
泰博期近月 泰博期 泰博 4736
台半期近月 台半期 台半 5425
元大高股息期近月 元大高股息期 元大高股息 0056
台灣高鐵期近月 台灣高鐵期 台灣高鐵 2633
祥碩期近月 祥碩期 祥碩 5269
力旺期近月 力旺期 力旺 3529
台光電期近月 台光電期 台光電 2383
信昌電期近月 信昌電期 信昌電 6173
合晶期近月 合晶期 合晶 6182
大江期近月 大江期 大江 8436
小型祥碩期近月 小型祥碩期 祥碩 5269
宣德期近月 宣德期 宣德 5457
金居期近月 金居期 金居 8358
宏捷科期近月 宏捷科期 宏捷科 8086
神達期近月 神達期 神達 3706
雙鴻期近月 雙鴻期 雙鴻 3324
小型聯發科期近月 小型聯發科期 聯發科 2454
緯穎期近月 緯穎期 緯穎 6669
小型緯穎期近月 小型緯穎期 緯穎 6669
鈊象期近月 鈊象期 鈊象 3293
小型鈊象期近月 小型鈊象期 鈊象 3293
信驊期近月 信驊期 信驊 5274
小型信驊期近月 小型信驊期 信驊 5274
富采期近月 富采期 富采 3714
裕民期近月 裕民期 裕民 2606
台勝科期近月 台勝科期 台勝科 3532
小型國巨期近月 小型國巨期 國巨 2327
小型台積電期近月(一般) 小型台積電期 台積電 2330
小型瑞昱期近月 小型瑞昱期 瑞昱 2379
小型聯詠期近月 小型聯詠期 聯詠 3034
小型穩懋期近月 小型穩懋期 穩懋 3105
小型玉晶光期近月 小型玉晶光期 玉晶光 3406
永豐餘期近月 永豐餘期 永豐餘 1907
精材期近月 精材期 精材 3374
小型上銀期近月 小型上銀期 上銀 2049
小型群聯期近月 小型群聯期 群聯 8299
長興期近月 長興期 長興 1717
正隆期近月 正隆期 正隆 1904
僑威期近月 僑威期 僑威 3078
小型華碩期近月 小型華碩期 華碩 2357
小型南電期近月 小型南電期 南電 8046
超豐期近月 超豐期 超豐 2441
南茂期近月 南茂期 南茂 8150
光罩期近月 光罩期 光罩 2338
威盛期近月 威盛期 威盛 2388
萬海期近月 萬海期 萬海 2615
高端疫苗期近月 高端疫苗期 高端疫苗 6547
力積電期近月 力積電期 力積電 6770
奇鋐期近月 奇鋐期 奇鋐 3017
中磊期近月 中磊期 中磊 5388
漢翔期近月 漢翔期 漢翔 2634
中天期近月 中天期 中天 4128
新唐期近月 新唐期 新唐 4919
小型嘉澤期近月 小型嘉澤期 嘉澤 3533
小型健策期近月 小型健策期 健策 3653
國泰永續高股息期近月 國泰永續高股息期 國泰永續高股息 00878
大亞期近月 大亞期 大亞 1609
金像電期近月 金像電期 金像電 2368
元晶期近月 元晶期 元晶 6443
富邦媒期近月 富邦媒期 富邦媒 8454
合一期近月 合一期 合一 4743
立端期近月 立端期 立端 6245
寶雅期近月 寶雅期 寶雅 5904
小型富邦媒期近月 小型富邦媒期 富邦媒 8454
小型寶雅期近月 小型寶雅期 寶雅 5904
小型力旺期近月 小型力旺期 力旺 3529
世紀鋼期近月 世紀鋼期 世紀鋼 9958
小型台達電期近月 小型台達電期 台達電 2308
小型創意期近月 小型創意期 創意 3443
富邦越南期近月 富邦越南期 富邦越南 00885
群益台ESG低碳50期近月 群益台ESG低碳50期 群益台ESG低碳50 00923
元大美債20年期近月(一般) 元大美債20年期 元大美債20年 00679B
美時期近月 美時期 美時 1795
華紙期近月 華紙期 華紙 1905
小型聚陽期近月 小型聚陽期 聚陽 1477
中興電期近月 中興電期 中興電 1513
小型智邦期近月 小型智邦期 智邦 2345
小型台光電期近月 小型台光電期 台光電 2383
國泰智能電動車期近月 國泰智能電動車期 國泰智能電動車 00893
元大美債1-3期近月 元大美債1-3期 元大美債1-3 00719B
神基期近月 神基期 神基 3005
至上期近月 至上期 至上 8112
小型技嘉期近月 小型技嘉期 技嘉 2376
群益台灣精選高息期近月 群益台灣精選高息期 群益台灣精選高息 00919
復華台灣科技優息期近月 復華台灣科技優息期 復華台灣科技優息 00929
中信高評級公司債期近月 中信高評級公司債期 中信高評級公司債 00772B
小型元大台灣50ETF期近月(一般) 小型元大台灣50ETF期 元大台灣50ETF 0050
小型元大高股息期近月 小型元大高股息期 元大高股息 0056
元大台灣價值高息期近月 元大台灣價值高息期 元大台灣價值高息 00940
小型川湖期近月 小型川湖期 川湖 2059
小型世紀鋼期近月 小型世紀鋼期 世紀鋼 9958
家登期近月 家登期 家登 3680
小型家登期近月 小型家登期 家登 3680
士電期近月 士電期 士電 1503
亞翔期近月 亞翔期 亞翔 6139
廣明期近月 廣明期 廣明 6188
上海商銀期近月 上海商銀期 上海商銀 5876
台塑化期近月 台塑化期 台塑化 6505
達發期近月 達發期 達發 6526
小型奇鋐期近月 小型奇鋐期 奇鋐 3017
小型達發期近月 小型達發期 達發 6526
群益ESG投等債20+期近月 群益ESG投等債20+期 群益ESG投等債20+ 00937B
國泰20年美債期近月 國泰20年美債期 國泰20年美債 00687B
小型雙鴻期近月 小型雙鴻期 雙鴻 3324
世芯-KY期近月 世芯-KY期 世芯-KY 3661
小型世芯-KY期近月 小型世芯-KY期 世芯-KY 3661
保瑞期近月 保瑞期 保瑞 6472
小型保瑞期近月 小型保瑞期 保瑞 6472
統一FANG+期近月 統一FANG+期 統一FANG+ 00757
小型統一FANG+期近月 小型統一FANG+期 統一FANG+ 00757
一詮期近月 一詮期 一詮 2486
台灣虎航期近月 台灣虎航期 台灣虎航 6757
旺矽期近月 旺矽期 旺矽 6223
小型旺矽期近月 小型旺矽期 旺矽 6223
"""
